# FabricationRodInfo Properties

---
The FabricationRodInfo type exposes the following members.
| Name| Description
---|---|---
| CanRodsBeHosted|  Controls whether the hanger's rod's will be automatically hosted by other elements.
| IsAttachedToStructure|  Checks if the hanger is attached to structure.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| RodCount|  Gets the number of rods.
Top
#### Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace